// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

Console.Clear();

Console.WriteLine("Введите число от 1 до 7:")
int N = int.Parse(Console.ReadLine ()!); 

Console.WriteLine($"День недели : {num}");

if(num = 6, 7)
{
    Console.WriteLine($"Является выходным днём");
}